package com.mouzu.project.interview.network;

public class HttpInfo {
    /**
     * -》http协议的理解
     * 超文本传输协议（英文：HyperText Transfer Protocol，缩写：HTTP）是一种用于分布式、协作式和超媒体信息系统的应用层协议。
     * HTTP是万维网的数据通信的基础。
     * 原理：
     * 1、客户端的浏览器首先要通过网络与服务器建立连接，该连接是通过 TCP 来完成的，一般 TCP 连接的端口号是80。
     * 建立连接后，客户机发送一个请求给服务器，请求方式的格式为：统一资源标识符（URI）、协议版本号，后边是 MIME 信息包括请求修饰符、
     * 客户机信息和许可内容
     * 2、服务器接到请求后，给予相应的响应信息，其格式为一个状态行，包括信息的协议版本号、一个成功或错误的代码，
     * 后边是 MIME 信息包括服务器信息、实体信息和可能的内容
     *
     * -》https协议的理解
     * 是以安全为目标的 HTTP 通道，是 HTTP 的安全版。HTTPS 的安全基础是 SSL。SSL 协议位于 TCP/IP 协议与各种应用层协议之间，
     * 为数据通讯提供安全支持；
     *
     * -》tcp协议
     * 传输控制协议
     */
}
